src/Documents/ИнвентаризацияОС/ИнвентаризацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияОС</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТретийЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоФактуУУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоФактуБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечанияУУ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримечанияБУ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/КодыОрганизации/КодыОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыОрганизации</name>
  <comment>Параметры регистрации и коды организации </comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРегистрации</name>
    <comment>Номер регистрации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемЗарегистрирована</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистрацииПФ</name>
    <comment>Номер регистрации в ПФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРегистрацииВСлужбеЗанятости</name>
    <comment>Номер регистрации в службе занятости</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяИнспекция</name>
    <comment>Налоговая инспекция</comment>
    <type>
      <types>CatalogRef.НалоговыеИнспекции</types>
    </type>
  </resources>
  <resources>
    <name>КодПоЕДРПОУ</name>
    <comment>Код ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИНН</name>
    <comment>Индивидуальный налоговый номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСвидетельства</name>
    <comment>Номер свидетельства</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодЗКГНГ</name>
    <comment>Код по ЗКГНГ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСПОДУ</name>
    <comment>Код по СПОДУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКВЕД</name>
    <comment>Код по КВЕД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКОАТУУ</name>
    <comment>Код по КОАТУУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКФВ</name>
    <comment>Код КФВ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерФСС</name>
    <comment>Номер регистрации ФСС от временной потери трудоспособности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерФССНесчСлучай</name>
    <comment>Номер регистрации в ФСС от несчастного случая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отрасль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Территория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФормаСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОрганГУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОПФГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОПФГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОрганаПФУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеРабочегоОрганаФонда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФИОДиректораФонда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>КлассПрофессиональногоРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет/ПервоначальныеСведенияОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПервоначальныеСведенияОС/ПервоначальныеСведенияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияОС</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСостояния</name>
    <comment>Дата состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <comment>Основное средство</comment>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияОСОрганизаций/СостоянияОСОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОСОрганизаций</name>
  <comment>Состояния ОС организаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСостояния</name>
    <comment>Дата состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <comment>Основное средство</comment>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <comment>Состояние</comment>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ИнвентаризацияОС/ObjectModule.bsl
Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми

Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр();
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для управленческого учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

	мСтрокаРеквизитыУпрУчета =  "Подразделение,
								|МОЛ,
								|ОС.КоличествоУУ,
								|ОС.КоличествоПоФактуУУ,
								|ОС.РасхожденияУУ,
								|ОС.ПримечанияУУ
								|";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета =  "ПодразделениеОрганизации,
								|МОЛОрганизации,
								|ОС.КоличествоБУ,
								|ОС.КоличествоПоФактуБУ,
								|ОС.РасхожденияБУ,
								|ОС.ПримечанияБУ
								|";
	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьУправленческий(Черновик = Ложь)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентаризацияОС.Дата                        КАК ДатаАкта,
	               |	ИнвентаризацияОС.Номер                       КАК НомерАкта,
	               |	ИнвентаризацияОС.Подразделение.Представление КАК Подразделение,
	               |	ИнвентаризацияОС.МОЛ.Представление           КАК МОЛ
	               |ИЗ
	               |	Документ.ИнвентаризацияОС                    КАК ИнвентаризацияОС
	               |
	               |ГДЕ
	               |	ИнвентаризацияОС.Ссылка = &Ссылка";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",   Ссылка);
	Запрос.УстановитьПараметр("СписокОС", СписокОС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска        КАК ГодВыпуска,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта,
	               |	ИнвентаризацияОСОС.КоличествоУУ                        КАК Количество," + ?(Не Черновик,"
	               |	ИнвентаризацияОСОС.КоличествоПоФактуУУ                 КАК КоличествоПоФакту,", "") + "
	               |	ИнвентаризацияОСОС.ПримечанияУУ                        КАК Примечания,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.Код                КАК ИнвентарныйНомер
	               |ИЗ
	               |	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	               |
	               |ГДЕ
	               |	ИнвентаризацияОСОС.Ссылка = &Ссылка
	               |
	               |ИТОГИ СУММА(Количество)" + ?(Не Черновик, " ,СУММА(КоличествоПоФакту)", "") + " ПО
	               |	ОБЩИЕ";
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	Макет         = ПолучитьМакет("Инвентаризация");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы.Параметры.ТипУчета_ = "Управлін-";
	ОбластьШапкаТаблицы.Параметры.ТипУчета  = "ського";
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
	ОбластьМакета.Параметры.Организация = "Управлінський облік";
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	НомерПП = 0;
	СтруктураПодвала = Новый Структура;
	
	Если ЗначениеЗаполнено(ВыборкаПоШапке.МОЛ) Тогда
		
		СтруктураПодвала.Вставить("МОЛ", "/ " + ВыборкаПоШапке.МОЛ + " /");
		
	КонецЕсли;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
	Пока ВыборкаПоОС.Следующий() Цикл
		
		Если ВыборкаПоОС.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			
			Если Не Черновик Тогда
				
				СтруктураПодвала.Вставить("КоличествоИтого",        ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.Количество));
				СтруктураПодвала.Вставить("КоличествоПоФактуИтого", ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.КоличествоПоФакту));
				
			КонецЕсли;
			
			Продолжить
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.Количество) и НЕ ЗначениеЗаполнено(ВыборкаПоОС.Примечания)
			и (Черновик или НЕ ЗначениеЗаполнено(ВыборкаПоОС.КоличествоПоФакту)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НомерПП                       = НомерПП + 1;
		ОбластьМакета                 = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Номер = НомерПП;
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоОС);
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Если Черновик Тогда
		
		ЧислоПустыхСтрок = 0;
		
		Если ВвестиЧисло(ЧислоПустыхСтрок, "Сколько пустых строк вывести?", 5, 0) Тогда
			
			Для Н = 1 По ЧислоПустыхСтрок Цикл
			
				НомерПП                       = НомерПП + 1;
				ОбластьМакета                 = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Номер = НомерПП;
		
				Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьШапкаТаблицы);
					
				КонецЕсли;
		
				ТабДокумент.Вывести(ОбластьМакета);
			
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе //Если не черновик, то выводится подвал
		
		Если НомерПП <> 0 Тогда
			
			СтруктураПодвала.Вставить("НачальнийНомер", 1);
			СтруктураПодвала.Вставить("КонечныйНомер",  НомерПП);
			СтруктураПодвала.Вставить("ПорядковыеПрописью",  ЧислоПрописью(НомерПП,"Л=uk_UA;НП=Ложь;НД=Ложь",",,,м,,,,,0"));
			СтруктураПодвала.Вставить("КоличествоПрописью",  ЧислоПрописью(СтруктураПодвала.КоличествоПоФактуИтого,
			                                                               "Л=uk_UA;НП=Ложь;НД=Ложь",",,,ж,,,,,0"));
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомиссии);
		
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Расписка");
		ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;	
	
    ТабДокумент.ОбластьПечати = ТабДокумент.Область( , 2, , 10);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьУправленческий()

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьБухгалтерский(Черновик = Ложь)
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТекДата",        МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентаризацияОС.Дата                                   КАК ДатаАкта,
	               |	ИнвентаризацияОС.Номер                                  КАК НомерАкта,
	               |	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК Подразделение,
	               |	ИнвентаризацияОС.МОЛОрганизации.Представление           КАК МОЛ,
	               |	ВЫРАЗИТЬ(ИнвентаризацияОС.Организация.НаименованиеПолное 
				   |	                          КАК СТРОКА(1000))             КАК Организация,
	               |	КодыОрганизации.КодПоЕДРПОУ                             КАК ЕДРПОУ
	               |ИЗ
	               |	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&ТекДата,
				   |		                                 Организация = &ТекОрганизация) КАК КодыОрганизации
	               |		ПО ИнвентаризацияОС.Организация = КодыОрганизации.Организация
	               |
	               |ГДЕ
	               |	ИнвентаризацияОС.Ссылка = &Ссылка";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",   Ссылка);
	Запрос.УстановитьПараметр("СписокОС", СписокОС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПервоначальныеСведенияБУ.ИнвентарныйНомер              КАК ИнвентарныйНомер,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска        КАК ГодВыпуска,
	               |	ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта,
	               |	ИнвентаризацияОСОС.КоличествоБУ                        КАК Количество," + ?(Не Черновик, "
	               |	ИнвентаризацияОСОС.КоличествоПоФактуБУ                 КАК КоличествоПоФакту,", "") + "
	               |	ИнвентаризацияОСОС.ПримечанияБУ КАК Примечания
	               |ИЗ
	               |	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет 
				   |		                         КАК ПервоначальныеСведенияБУ
	               |		ПО ИнвентаризацияОСОС.ОсновноеСредство = ПервоначальныеСведенияБУ.ОсновноеСредство
	               |
	               |ГДЕ
	               |	ИнвентаризацияОСОС.Ссылка = &Ссылка
	               |
	               |ИТОГИ СУММА(Количество)" + ?(Не Черновик, " ,СУММА(КоличествоПоФакту)", "") + " ПО
	               |	ОБЩИЕ";
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТабДокумент         = Новый ТабличныйДокумент();
	Макет               = ПолучитьМакет("Инвентаризация");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы.Параметры.ТипУчета_ = "Бухгалтер-";
	ОбластьШапкаТаблицы.Параметры.ТипУчета  = "ського";
	ОбластьМакета       = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
	ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	НомерПП = 0;
	СтруктураПодвала = Новый Структура;
	
	Если ЗначениеЗаполнено(ВыборкаПоШапке.МОЛ) Тогда
		
		СтруктураПодвала.Вставить("МОЛ", "/ " + ВыборкаПоШапке.МОЛ + " /");
		
	КонецЕсли;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
	Пока ВыборкаПоОС.Следующий() Цикл
		
		Если ВыборкаПоОС.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			
			Если Не Черновик Тогда
				
				СтруктураПодвала.Вставить("КоличествоИтого",        ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.Количество));
				СтруктураПодвала.Вставить("КоличествоПоФактуИтого", ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.КоличествоПоФакту));
				
			КонецЕсли;
			
			Продолжить
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.Количество) и НЕ ЗначениеЗаполнено(ВыборкаПоОС.Примечания)
			и (Черновик или НЕ ЗначениеЗаполнено(ВыборкаПоОС.КоличествоПоФакту)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НомерПП                       = НомерПП + 1;
		ОбластьМакета                 = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Номер = НомерПП;
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоОС);
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Если Черновик Тогда
		
		ЧислоПустыхСтрок = 0;
		
		Если ВвестиЧисло(ЧислоПустыхСтрок, "Сколько пустых строк вывести?", 5, 0) Тогда
			
			Для Н = 1 По ЧислоПустыхСтрок Цикл
			
				НомерПП                       = НомерПП + 1;
				ОбластьМакета                 = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Номер = НомерПП;
				
				Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьШапкаТаблицы);
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
			
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе //Если не черновик, то выводится подвал
		
		Если НомерПП <> 0 Тогда
			
			СтруктураПодвала.Вставить("НачальнийНомер", 1);
			СтруктураПодвала.Вставить("КонечныйНомер",  НомерПП);
			СтруктураПодвала.Вставить("ПорядковыеПрописью",  ЧислоПрописью(НомерПП,"Л=uk_UA;НП=Ложь;НД=Ложь",",,,м,,,,,0"));
			СтруктураПодвала.Вставить("КоличествоПрописью",  ЧислоПрописью(СтруктураПодвала.КоличествоПоФактуИтого,
			                                                               "Л=uk_UA;НП=Ложь;НД=Ложь",",,,ж,,,,,0"));
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомиссии);
		
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Расписка");
		ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьМакета) Тогда			
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;	
	
    ТабДокумент.ОбластьПечати = ТабДокумент.Область( , 2, , 10);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьБухгалтерский()

// Функция формирует табличный документ по регламентированной форме ОЗ-9
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
Функция ПечатьОЗ9(ПечатьПоДаннымУпрУчета = Ложь)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТекДата",        МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнвентаризацияОС.Дата                                   КАК ДатаАкта,
	|	ИнвентаризацияОС.Номер                                  КАК НомерАкта,"
	+ ?(ПечатьПоДаннымУпрУчета,"
	|	ИнвентаризацияОС.Подразделение.Представление КАК Подразделение,
	|	ИнвентаризацияОС.МОЛ.Представление           КАК МОЛ"
	 , "
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК Подразделение,
	|	ИнвентаризацияОС.МОЛОрганизации.Представление           КАК МОЛ,
	|	ВЫРАЗИТЬ(ИнвентаризацияОС.Организация.НаименованиеПолное 
	|	                          КАК СТРОКА(1000))             КАК Организация,
	|	КодыОрганизации.КодПоЕДРПОУ                             КАК ЕДРПОУ"
	)+ "
	|ИЗ
	|	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&ТекДата,
	|		                                 Организация = &ТекОрганизация) КАК КодыОрганизации
	|		ПО ИнвентаризацияОС.Организация = КодыОрганизации.Организация
	|
	|ГДЕ
	|	ИнвентаризацияОС.Ссылка = &Ссылка";
	
	
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаДок"             , Дата);
	Запрос.УстановитьПараметр("МоментДок"           , МоментВремени());
	Запрос.УстановитьПараметр("Организация"           , Организация);
	Запрос.УстановитьПараметр("Ссылка"              , Ссылка);
	Запрос.УстановитьПараметр("СписокОС"            , СписокОС);
	Запрос.УстановитьПараметр("СостояниеСнятоСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	
	Если ПечатьПоДаннымУпрУчета Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОС.Период                        КАК ДатаДок,
		|	ПервоначальныеСведенияОС.Регистратор.Номер             КАК НомерДок,
		|	ИнвентаризацияОСОС.ОсновноеСредство.Код                КАК ИнвентарныйНомер,
		|	ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость       КАК БалансоваяСтоимость,
		|	СостояниеОС.ДатаСписания                               КАК ДатаСписания,
		|	СостояниеОС.НомерСписания                              КАК НомерСписания,
		|	СостояниеОС.ПричинаСписания                            КАК ПричинаСписания
		|ИЗ
		|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(
		|			                &МоментДок, 
		|			                ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
		|		ПО ИнвентаризацияОСОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			(ВЫБРАТЬ
		|				СостоянияОС.ОсновноеСредство  КАК ОсновноеСредство,
		|				ВЫБОР
		|					КОГДА СостоянияОС.Регистратор ССЫЛКА Документ.СписаниеОС
		|						ТОГДА СостоянияОС.Регистратор.ПричинаСписания
		|					ИНАЧЕ ""Передача""
		|				КОНЕЦ                         КАК ПричинаСписания,
		|				СостоянияОС.ДатаСостояния     КАК ДатаСписания,
		|				СостоянияОС.Регистратор.Номер КАК НомерСписания
		|			ИЗ
		|				РегистрСведений.СостоянияОС КАК СостоянияОС
		|			ГДЕ
		|				СостоянияОС.Состояние = &СостояниеСнятоСУчета
		|				И СостоянияОС.ОсновноеСредство В(&СписокОС)
		|				И СостоянияОС.ДатаСостояния <= &ДатаДок) КАК СостояниеОС
		|		ПО ИнвентаризацияОСОС.ОсновноеСредство = СостояниеОС.ОсновноеСредство
		|ГДЕ
		|	ИнвентаризацияОСОС.Ссылка = &Ссылка";
		
	Иначе

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОС.Период                        КАК ДатаДок,
		|	ПервоначальныеСведенияОС.Регистратор.Номер             КАК НомерДок,
		|	ПервоначальныеСведенияОС.ИнвентарныйНомер              КАК ИнвентарныйНомер,
		|	ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость       КАК БалансоваяСтоимость,
		|	СостояниеОС.НомерСписания                              КАК НомерСписания,
		|	СостояниеОС.ДатаСписания                               КАК ДатаСписания,
		|	СостояниеОС.ПричинаСписания                            КАК ПричинаСписания
		|ИЗ
		|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
		|			               &МоментДок,
		|			               Организация = &Организация
		|			               И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
		|		ПО ИнвентаризацияОСОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			(ВЫБРАТЬ
		|				СостоянияОС.ОсновноеСредство  КАК ОсновноеСредство,
		|				СостоянияОС.Регистратор.Номер КАК НомерСписания,
		|				СостоянияОС.ДатаСостояния     КАК ДатаСписания,
		|				ВЫБОР
		|					КОГДА СостоянияОС.Регистратор ССЫЛКА Документ.СписаниеОС
		|						ТОГДА СостоянияОС.Регистратор.ПричинаСписания
		|					ИНАЧЕ ""Передача""
		|				КОНЕЦ                         КАК ПричинаСписания
		|			ИЗ
		|				РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
		|			ГДЕ
		|				СостоянияОС.Организация = &Организация
		|				И СостоянияОС.ОсновноеСредство В(&СписокОС)
		|				И СостоянияОС.Состояние = &СостояниеСнятоСУчета
		|				И СостоянияОС.ДатаСостояния <= &ДатаДок) КАК СостояниеОС
		|		ПО ИнвентаризацияОСОС.ОсновноеСредство = СостояниеОС.ОсновноеСредство
		|ГДЕ
		|	ИнвентаризацияОСОС.Ссылка = &Ссылка";
		
	КонецЕсли;

	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТабДокумент         = Новый ТабличныйДокумент();
	Макет               = ПолучитьМакет("ОЗ9");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
	
	Если Не ПечатьПоДаннымУпрУчета Тогда
		
		ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
		
	Иначе
		
		ОбластьМакета.Параметры.Организация = "Управлінський облік";
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Номера = Макет.ПолучитьОбласть("Номера");
	ТабДокумент.Вывести(Номера);
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R"+ ТабДокумент.ВысотаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаПоОС.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоОС);
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДокумент;


КонецФункции // ПечатьОЗ9()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Управленческий" тогда
		
		ТабДокумент = ПечатьУправленческий();
		
	ИначеЕсли  ИмяМакета = "УправленческийЧерновик" Тогда
		
		ТабДокумент = ПечатьУправленческий(Истина);
		
	ИначеЕсли ИмяМакета = "Бухгалтерский" Тогда
		
		ТабДокумент = ПечатьБухгалтерский();
		
	ИначеЕсли ИмяМакета = "БухгалтерскийЧерновик" Тогда
		
		ТабДокумент = ПечатьБухгалтерский(Истина);
		
	ИначеЕсли ИмяМакета = "Управленческий" Тогда
		
		ТабДокумент = ПечатьБухгалтерский(Истина);
		
	ИначеЕсли ИмяМакета = "ОЗ9бух" Тогда
		
		ТабДокумент = ПечатьОЗ9();
		
	ИначеЕсли ИмяМакета = "ОЗ9упр" Тогда
		
		ТабДокумент = ПечатьОЗ9(Истина);
		
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	Если ОтражатьВУправленческомУчете Тогда
		
		СтруктураМакетов.Вставить("Управленческий",			"Управленческий учет");
		СтруктураМакетов.Вставить("УправленческийЧерновик",	"Управленческий учет (Черновик)");
		СтруктураМакетов.Вставить("ОЗ9упр",					"Форма ОЗ-9(упр. учет)");
		
	КонецЕсли;

	Если ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураМакетов.Вставить("Бухгалтерский",			"Бухгалтерский учет");
		СтруктураМакетов.Вставить("БухгалтерскийЧерновик",	"Бухгалтерский учет (Черновик)");
		СтруктураМакетов.Вставить("ОЗ9бух",					"Форма ОЗ-9(бух. учет)");
		
	КонецЕсли;
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРКИ ПРАВИЛЬНОСТИ ЗАПОЛНЕНИЯ

// Формирует структуру полей, обязательных для заполнения при отражении фактического
// движения средств по банку.
//
// Возвращаемое значение:
//   СтруктураОбязательныхПолей   – структура для проверки
//
Функция СтруктураОбязательныхПолейШапки(СтруктураШапкиДокумента)

	СтруктураПолей = Новый Структура;

	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейОплата()


// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧ(СтруктураШапкиДокумента, Отказ, Заголовок)

    СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("ОсновноеСредство");
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, Отказ, Заголовок)

	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, Отказ, Заголовок)

	
КонецПроцедуры // ПроверитьЗаполнениеТЧ


// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолейШапки(СтруктураШапкиДокумента), Отказ, Заголовок);
	
	ПроверитьЗаполнениеТЧ(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
// для управленческого учета
Процедура ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		Возврат;
		
	КонецЕсли;

	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Подразделение");
	СтруктураПолей.Вставить("МОЛ");
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураПолей, Отказ, Заголовок);
	ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
// для бухгалтерского и налогового (в общем регламентного) учета
Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете ) Тогда
		
		Возврат;
		
	КонецЕсли;

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Организация");
	СтруктураПолей.Вставить("ПодразделениеОрганизации");
	СтруктураПолей.Вставить("МОЛОрганизации");


	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураПолей, Отказ, Заголовок);
	ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
         
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры
